# Задание 5
# Пункт 1

prices = [57.08, 46.51, 97, 34.7, 14.32, 30, 22.29, 98, 27.83, 75.90,
          32.08, 33, 79, 67.99, 78.4, 11, 54, 50.36, 35.99, 11.68,
          3.12, 68.58, 32, 11.02, 77, 26.99, 22.12, 55.76, 22, 87.33, 34.78]


for i in range(len(prices)):
    prices[i] = float(prices[i])
    prices[i] = "{0:.2f}".format(prices[i])
    prices[i] = str(prices[i]).split('.')

    for item in range(0, len(prices[i]), 2):
        print(prices[i][item], 'руб', end = " ")
    for item in range(1, len(prices[i]), 2):
        print(prices[i][item], 'коп,', end = " ")



# Пункт 2

prices = [57.08, 46.51, 97, 34.7, 14.32, 30, 22.29, 98, 27.83, 75.90,
          32.08, 33, 79, 67.99, 78.4, 11, 54, 50.36, 35.99, 11.68,
          3.12, 68.58, 32, 11.02, 77, 26.99, 22.12, 55.76, 22, 87.33, 34.78]
print(id(prices))

prices.sort()
print(prices)

print(id(prices))

# Пункт 3

prices = [57.08, 46.51, 97, 34.7, 14.32, 30, 22.29, 98, 27.83, 75.90,
          32.08, 33, 79, 67.99, 78.4, 11, 54, 50.36, 35.99, 11.68,
          3.12, 68.58, 32, 11.02, 77, 26.99, 22.12, 55.76, 22, 87.33, 34.78]

prices.sort()
prices_reversed = list(reversed(prices))
print(prices_reversed)

# Пункт 4
#
prices = [57.08, 46.51, 97, 34.7, 14.32, 30, 22.29, 98, 27.83, 75.90,
          32.08, 33, 79, 67.99, 78.4, 11, 54, 50.36, 35.99, 11.68,
          3.12, 68.58, 32, 11.02, 77, 26.99, 22.12, 55.76, 22, 87.33, 34.78]
prices.sort()
print(prices[-5:])



